### Intermediate datasets 

| Original /Intermediate dataset | Name |
| --- | ----------- | 
| D1 | emigrazione |
| D2, D3 | indipendenza economica | 
| D17 | occupazione laureati | 
| D4, D6 | condizione lavorativa per età |
| D7, D5 | retribuzione lavoro |

### I1 : indipendenza economica

In [34]:
import pandas as pd

# Read the CSV file
young = pd.read_csv("C:/Users/crosi/Documents/GitHub/cif/datasets/cleaned_csv/D2.csv", encoding="utf-8")
young.head(5)

         area  time_period  num_young
0  Nord-ovest         2014       60.6
1  Nord-ovest         2015       58.4
2  Nord-ovest         2016       59.3
3  Nord-ovest         2017       57.2
4  Nord-ovest         2018       57.6

In [35]:
import pandas as pd

# Read the CSV file
house = pd.read_csv("C:/Users/crosi/Documents/GitHub/cif/datasets/cleaned_csv/D3.csv", encoding="utf-8")
house.head(5)

         area  time_period  indices
0  Nord-ovest         2014    104.3
1  Nord-ovest         2015    100.0
2  Nord-ovest         2016    100.2
3  Nord-ovest         2017     99.5
4  Nord-ovest         2018     99.4

In [36]:
i1 = pd.merge(young, house, on=["time_period", "area"])
i1.to_csv("C:/Users/crosi/Documents/Github/cif/datasets/intermediate_datasets/i1.csv", index=False)
i1.head(5)

         area  time_period  num_young  indices
0  Nord-ovest         2014       60.6    104.3
1  Nord-ovest         2015       58.4    100.0
2  Nord-ovest         2016       59.3    100.2
3  Nord-ovest         2017       57.2     99.5
4  Nord-ovest         2018       57.6     99.4

### I2 : condizione lavorativa per età

soddisfazione totale e retribuzione per età

In [37]:
import pandas as pd

# Read the CSV file
satisfaction = pd.read_csv("C:/Users/crosi/Documents/GitHub/cif/datasets/cleaned_csv/D4.csv", encoding="utf-8")
satisfaction

,satisfaction_level,qualification,time_period,percentage
0,very much,"Primary school certificate, no educational degree",2014,31.3
1,very much,"Primary school certificate, no educational degree",2015,18.7
2,very much,"Primary school certificate, no educational degree",2016,0.0
3,very much,"Primary school certificate, no educational degree",2017,32.3
4,very much,"Primary school certificate, no educational degree",2018,44.7
...,...,...,...,...
175,not at all,Total,2018,4.6
176,not at all,Total,2019,4.1
177,not at all,Total,2020,2.9
178,not at all,Total,2021,2.7
179,not at all,Total,2022,1.3

In [38]:
for idx, i in satisfaction.iterrows():
    if i.iloc[1] == "Tertiary (university, doctoral and specialization courses)" or i.iloc[1] == "Primary school certificate, no educational degree" or i.iloc[1] == "Upper and post secondary" or i.iloc[1] =="Lower secondary school certificate":
        satisfaction = satisfaction.drop(idx)

x = []
y = []
z = []
k = []

for id, n in satisfaction.iterrows():
    if n.iloc[0] == " very much":
        value = n.iloc[3]
        x.append(value)
    if n.iloc[0] == " quite":
        value = n.iloc[3]
        y.append(value)
    if n.iloc[0] == " not much":
        value = n.iloc[3]
        z.append(value)
    if n.iloc[0] == " not at all":
        value = n.iloc[3]
        k.append(value)

df = satisfaction[['time_period']]
df_no_duplicates = df.drop_duplicates()
df_no_duplicates["very much"] = x
df_no_duplicates["quite"] = y
df_no_duplicates["not much"] = z
df_no_duplicates["not at all"] = k

df_no_duplicates

C:\Users\crosi\AppData\Local\Temp\ipykernel_23148\662646824.py:26: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_no_duplicates["very much"] = x
C:\Users\crosi\AppData\Local\Temp\ipykernel_23148\662646824.py:27: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_no_duplicates["quite"] = y
C:\Users\crosi\AppData\Local\Temp\ipykernel_23148\662646824.py:28: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_no_duplicates["not much"] = z
C:\Users\crosi\AppData\Local\Temp\ipykernel_23148\662646824.py:29: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_no_duplicates["not at all"] = k

    time_period  very much  quite  not much  not at all
36         2014       18.2   52.1      19.0         4.3
37         2015       19.9   55.2      18.5         2.2
38         2016       17.3   53.2      18.3         2.5
39         2017       16.9   57.1      16.2         3.5
40         2018       17.7   59.2      15.5         4.6
41         2019       20.6   55.1      13.4         4.1
42         2020       21.4   58.4      13.9         2.9
43         2021       19.9   58.5      13.9         2.7
44         2022       18.7   63.3      10.8         1.3

In [39]:
import pandas as pd

# Read the CSV file
wageage = pd.read_csv("C:/Users/crosi/Documents/GitHub/cif/datasets/cleaned_csv/D6.csv", encoding="utf-8")
wageage

      area         economic_activity  time_period  age 15-29
0    Italy                     TOTAL         2014       9.76
1    Italy                     TOTAL         2015       9.90
2    Italy                     TOTAL         2016       9.92
3    Italy                     TOTAL         2017      10.03
4    Italy                     TOTAL         2018      10.06
..     ...                       ...          ...        ...
835    Sud  Other service activities         2017       7.72
836    Sud  Other service activities         2018       7.67
837    Sud  Other service activities         2019       7.70
838    Sud  Other service activities         2020       7.81
839    Sud  Other service activities         2021       7.87

[840 rows x 4 columns]

In [40]:
for idx, i in wageage.iterrows():
    if i.iloc[1] != "TOTAL":
        wageage = wageage.drop(idx)
            
for idx, i in wageage.iterrows():
    if i.iloc[0] != "Italy":
        wageage = wageage.drop(idx)

        
wageage

    area economic_activity  time_period  age 15-29
0  Italy             TOTAL         2014       9.76
1  Italy             TOTAL         2015       9.90
2  Italy             TOTAL         2016       9.92
3  Italy             TOTAL         2017      10.03
4  Italy             TOTAL         2018      10.06
5  Italy             TOTAL         2019      10.15
6  Italy             TOTAL         2020      10.35
7  Italy             TOTAL         2021      10.37

In [41]:
i2 = pd.merge(wageage, df_no_duplicates, on="time_period")
i2.to_csv("C:/Users/crosi/Documents/Github/cif/datasets/intermediate_datasets/i2.csv", index=False)
i2

,area,economic_activity,time_period,age 15-29,very much,quite,not much,not at all
0,Italy,TOTAL,2014,9.76,18.2,52.1,19.0,4.3
1,Italy,TOTAL,2015,9.90,19.9,55.2,18.5,2.2
2,Italy,TOTAL,2016,9.92,17.3,53.2,18.3,2.5
3,Italy,TOTAL,2017,10.03,16.9,57.1,16.2,3.5
4,Italy,TOTAL,2018,10.06,17.7,59.2,15.5,4.6
5,Italy,TOTAL,2019,10.15,20.6,55.1,13.4,4.1
6,Italy,TOTAL,2020,10.35,21.4,58.4,13.9,2.9
7,Italy,TOTAL,2021,10.37,19.9,58.5,13.9,2.7

### I3 : retribuzione lavorativa

In [42]:
import pandas as pd

# Read the CSV file
c = pd.read_csv("C:/Users/crosi/Documents/GitHub/cif/datasets/cleaned_csv/D5.csv", encoding="utf-8")
c

,area,economic_activity,time_period,Temporary employees,Permanent employees
0,Italy,TOTAL,2014,10.05,11.69
1,Italy,TOTAL,2015,10.33,11.70
2,Italy,TOTAL,2016,10.24,11.81
3,Italy,TOTAL,2017,10.25,12.03
4,Italy,TOTAL,2018,10.27,12.10
...,...,...,...,...,...
835,Sud,Other service activities,2017,8.13,8.17
836,Sud,Other service activities,2018,8.08,8.18
837,Sud,Other service activities,2019,8.06,8.24
838,Sud,Other service activities,2020,8.31,8.45
839,Sud,Other service activities,2021,8.34,8.53

In [43]:
import pandas as pd

# Read the CSV file
ciao = pd.read_csv("C:/Users/crosi/Documents/GitHub/cif/datasets/cleaned_csv/D6.csv", encoding="utf-8")
ciao

      area         economic_activity  time_period  age 15-29
0    Italy                     TOTAL         2014       9.76
1    Italy                     TOTAL         2015       9.90
2    Italy                     TOTAL         2016       9.92
3    Italy                     TOTAL         2017      10.03
4    Italy                     TOTAL         2018      10.06
..     ...                       ...          ...        ...
835    Sud  Other service activities         2017       7.72
836    Sud  Other service activities         2018       7.67
837    Sud  Other service activities         2019       7.70
838    Sud  Other service activities         2020       7.81
839    Sud  Other service activities         2021       7.87

[840 rows x 4 columns]

In [44]:
import pandas as pd

# Read the CSV file
educationalq = pd.read_csv("C:/Users/crosi/Documents/GitHub/cif/datasets/cleaned_csv/D7.csv", encoding="utf-8")
educationalq

,area,economic_activity,time_period,"No educational degree, primary and lower secondary school certificate",Upper and post secondary,"Tertiary (university, doctoral and specialization courses)"
0,Italy,TOTAL,2014,10.53,11.41,13.83
1,Italy,TOTAL,2015,10.70,11.53,13.77
2,Italy,TOTAL,2016,10.69,11.53,13.80
3,Italy,TOTAL,2017,10.73,11.54,13.85
4,Italy,TOTAL,2018,10.74,11.56,13.86
...,...,...,...,...,...,...
835,Sud,Other service activities,2017,8.02,8.17,9.64
836,Sud,Other service activities,2018,8.05,8.12,9.53
837,Sud,Other service activities,2019,8.09,8.14,9.59
838,Sud,Other service activities,2020,8.27,8.38,10.45
839,Sud,Other service activities,2021,8.33,8.43,10.50

In [45]:


# Assuming c, educationalq, and age are your DataFrames
i3 = pd.merge(pd.merge(c, educationalq, on=["time_period", "area", "economic_activity"]), ciao, on=["time_period", "area", "economic_activity"])

# Save the merged DataFrame to a CSV file
i3.to_csv("C:/Users/crosi/Documents/Github/cif/datasets/intermediate_datasets/i3.csv", index=False)

# Display the merged DataFrame
i3

,area,economic_activity,time_period,Temporary employees,Permanent employees,"No educational degree, primary and lower secondary school certificate",Upper and post secondary,"Tertiary (university, doctoral and specialization courses)",age 15-29
0,Italy,TOTAL,2014,10.05,11.69,10.53,11.41,13.83,9.76
1,Italy,TOTAL,2015,10.33,11.70,10.70,11.53,13.77,9.90
2,Italy,TOTAL,2016,10.24,11.81,10.69,11.53,13.80,9.92
3,Italy,TOTAL,2017,10.25,12.03,10.73,11.54,13.85,10.03
4,Italy,TOTAL,2018,10.27,12.10,10.74,11.56,13.86,10.06
...,...,...,...,...,...,...,...,...,...
835,Sud,Other service activities,2017,8.13,8.17,8.02,8.17,9.64,7.72
836,Sud,Other service activities,2018,8.08,8.18,8.05,8.12,9.53,7.67
837,Sud,Other service activities,2019,8.06,8.24,8.09,8.14,9.59,7.70
838,Sud,Other service activities,2020,8.31,8.45,8.27,8.38,10.45,7.81
839,Sud,Other service activities,2021,8.34,8.53,8.33,8.43,10.50,7.87

### I4 focus su laureati

soddisfazione laureati + condizione occupazionale alma laurea + retribuzione per titolo di studio

In [46]:
import pandas as pd

# Read the CSV file
satisfaction = pd.read_csv("C:/Users/crosi/Documents/GitHub/cif/datasets/cleaned_csv/D4.csv", encoding="utf-8")
satisfaction

,satisfaction_level,qualification,time_period,percentage
0,very much,"Primary school certificate, no educational degree",2014,31.3
1,very much,"Primary school certificate, no educational degree",2015,18.7
2,very much,"Primary school certificate, no educational degree",2016,0.0
3,very much,"Primary school certificate, no educational degree",2017,32.3
4,very much,"Primary school certificate, no educational degree",2018,44.7
...,...,...,...,...
175,not at all,Total,2018,4.6
176,not at all,Total,2019,4.1
177,not at all,Total,2020,2.9
178,not at all,Total,2021,2.7
179,not at all,Total,2022,1.3

In [47]:
for idx, i in satisfaction.iterrows():
    if i.iloc[1] != "Tertiary (university, doctoral and specialization courses)":
        satisfaction = satisfaction.drop(idx)

x = []
y = []
z = []
k = []

for id, n in satisfaction.iterrows():
    if n.iloc[0] == " very much":
        value = n.iloc[3]
        x.append(value)
    if n.iloc[0] == " quite":
        value = n.iloc[3]
        y.append(value)
    if n.iloc[0] == " not much":
        value = n.iloc[3]
        z.append(value)
    if n.iloc[0] == " not at all":
        value = n.iloc[3]
        k.append(value)

df = satisfaction[['time_period']]
df_no_duplicates = df.drop_duplicates()
df_no_duplicates["very much"] = x
df_no_duplicates["quite"] = y
df_no_duplicates["not much"] = z
df_no_duplicates["not at all"] = k

df_no_duplicates

C:\Users\crosi\AppData\Local\Temp\ipykernel_23148\3509399612.py:26: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_no_duplicates["very much"] = x
C:\Users\crosi\AppData\Local\Temp\ipykernel_23148\3509399612.py:27: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_no_duplicates["quite"] = y
C:\Users\crosi\AppData\Local\Temp\ipykernel_23148\3509399612.py:28: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_no_duplicates["not much"] = z
C:\Users\crosi\AppData\Local\Temp\ipykernel_23148\3509399612.py:29: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_no_duplicates["not at all"] = k

    time_period  very much  quite  not much  not at all
27         2014       17.4   43.9      19.5         2.2
28         2015       31.2   55.4      13.4         0.0
29         2016       22.3   53.5      16.6         0.0
30         2017       16.1   48.7      22.5         5.9
31         2018       18.5   65.6       8.7         2.6
32         2019       20.9   58.0      13.9         0.0
33         2020       24.9   68.5       2.7         1.6
34         2021       17.0   61.9      11.7         5.1
35         2022       20.6   70.8       6.7         0.0

In [48]:
import pandas as pd

# Read the CSV file
condocc = pd.read_csv("C:/Users/crosi/Documents/GitHub/cif/datasets/cleaned_csv/D17.csv", encoding="utf-8")
condocc = condocc[['total', 'time_period']]
condocc

  total  time_period
0  79,9         2014
1  79,6         2015
2  80,1         2016
3  82,5         2017
4  81,8         2018
5  84,4         2019
6  83,9         2020
7  85,7         2021
8  86,1         2022

In [49]:
import pandas as pd

# Read the CSV file
ciaone = pd.read_csv("C:/Users/crosi/Documents/GitHub/cif/datasets/cleaned_csv/D7.csv", encoding="utf-8")
ciaone = ciaone[['area', 'economic_activity', 'time_period', 'Tertiary (university, doctoral and specialization courses)']]
ciaone

,area,economic_activity,time_period,"Tertiary (university, doctoral and specialization courses)"
0,Italy,TOTAL,2014,13.83
1,Italy,TOTAL,2015,13.77
2,Italy,TOTAL,2016,13.80
3,Italy,TOTAL,2017,13.85
4,Italy,TOTAL,2018,13.86
...,...,...,...,...
835,Sud,Other service activities,2017,9.64
836,Sud,Other service activities,2018,9.53
837,Sud,Other service activities,2019,9.59
838,Sud,Other service activities,2020,10.45
839,Sud,Other service activities,2021,10.50

In [50]:
for idx, i in ciaone.iterrows():
    if i.iloc[1] != "TOTAL":
        ciaone = ciaone.drop(idx)
            
for idx, i in ciaone.iterrows():
    if i.iloc[0] != "Italy":
        ciaone = ciaone.drop(idx)

        
ciaone

,area,economic_activity,time_period,"Tertiary (university, doctoral and specialization courses)"
0,Italy,TOTAL,2014,13.83
1,Italy,TOTAL,2015,13.77
2,Italy,TOTAL,2016,13.80
3,Italy,TOTAL,2017,13.85
4,Italy,TOTAL,2018,13.86
5,Italy,TOTAL,2019,14.11
6,Italy,TOTAL,2020,14.57
7,Italy,TOTAL,2021,14.75

In [51]:


# Assuming c, educationalq, and age are your DataFrames
i4 = pd.merge(pd.merge(df_no_duplicates, condocc, on="time_period"), ciaone, on="time_period")

# Save the merged DataFrame to a CSV file
i4.to_csv("C:/Users/crosi/Documents/Github/cif/datasets/intermediate_datasets/i4.csv", index=False)

# Display the merged DataFrame
i4

,time_period,very much,quite,not much,not at all,total,area,economic_activity,"Tertiary (university, doctoral and specialization courses)"
0,2014,17.4,43.9,19.5,2.2,"79,9",Italy,TOTAL,13.83
1,2015,31.2,55.4,13.4,0.0,"79,6",Italy,TOTAL,13.77
2,2016,22.3,53.5,16.6,0.0,"80,1",Italy,TOTAL,13.80
3,2017,16.1,48.7,22.5,5.9,"82,5",Italy,TOTAL,13.85
4,2018,18.5,65.6,8.7,2.6,"81,8",Italy,TOTAL,13.86
5,2019,20.9,58.0,13.9,0.0,"84,4",Italy,TOTAL,14.11
6,2020,24.9,68.5,2.7,1.6,"83,9",Italy,TOTAL,14.57
7,2021,17.0,61.9,11.7,5.1,"85,7",Italy,TOTAL,14.75